read_liberty -lib -ignore_miss_dir -setattr blackbox /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/osu018_stdcells.lib
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_dbg_uart.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_wakeup_cell.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/openMSP430_defines.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_sync_reset.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_sync_cell.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_alu.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_frontend.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_multiplier.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/openMSP430_undefines.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/openMSP430.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_clock_module.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_mem_backbone.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_watchdog.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_scan_mux.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_dbg_hwbrk.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_dbg.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_clock_gate.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_register_file.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_dbg_i2c.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_clock_mux.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_sfr.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_execution_unit.v
read_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/verilog/omsp_and_gate.v
hierarchy -top openMSP430
synth -top openMSP430
splitnets -ports -format ___
dfflibmap -liberty /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/osu018_stdcells.lib
opt
abc -liberty /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/osu018_stdcells.lib 
flatten
clean -purge
iopadmap -outpad BUFX2 A:Y -bits
opt
clean
write_verilog /home/vinit-linux/Desktop/vsd_tcl_programming/synth_tcl/outdir_openMSP430/openMSP430.synth.v